Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Dt.189} “Moreover, Subhūti, when bodhisattva great beings dwell in the perfection of perseverance, they will encourage, secure, and establish all beings in the perfection of perseverance.

source: སེམས་ཅན་ཐམས་ཅད་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་བ་དང་། གཞོག་ཅིང་འགོད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། སེམས་ཅན་ཐམས་ཅད་ལུས་དང་། སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་བསྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ།
en: Subhūti, if one were to ask in what way bodhisattva great beings, abiding in the perfection of tolerance, encourage, secure, and establish all beings in the perfection of perseverance, Subhūti, it is by those bodhisattva great beings setting their minds on all-aspect omniscience that they will encourage, secure, and establish all beings in physical and mental perseverance. “

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་བཀོད་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་དེས། སེམས་ཅན་གང་ཡང་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་བཀོད་པ་ཡོད་དམ།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people, and then encourage, secure, and establish them in physical and mental perseverance, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would establish any beings in physical and mental perseverance?” “

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ། ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་ལུས་དང་། སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་བཀོད་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish immeasurable, countless beings in physical and mental perseverance, but they do not actually establish any beings at all in physical and mental perseverance.

source: རབ་འབྱོར་དེ་ནི་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because, commencing with the reality of illusion, this is in fact the reality of all phenomena.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་བ་དང་། གཞོག་ཅིང་འགོད་པ་ཡིན་ཞེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings dwell in the perfection of meditative concentration, they will encourage, secure, and establish all beings in the perfection of meditative concentration.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་ལ་གནས་ཤིང་། ཆོས་གང་ལ་ཡང་འཁྲུག་པ་འམ། འཁྲུག་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་ཏེ། དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་པ་དང་། འགོད་པ་བྱེད་དེ། དེ་ལྟར་ཡང་དག་པར་བསྐུལ་བ་རྣམས་ཀྱང་། ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་གྱུར་གྱི་བར་དུ། ནམ་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མི་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, if one were to ask in what way bodhisattva great beings, abiding in the perfection of meditative concentration, encourage, secure, and establish all beings in the perfection of meditative concentration, Subhūti, it is by those bodhisattva great beings dwelling in the true nature of all phenomena, and—without considering anything to be distracted or undistracted—dwelling in the perfection of meditative concentration; that is how they encourage, secure, and establish all beings, too, in the perfection of meditative concentration, and those whom they thus encourage, until they have attained consummate buddhahood in unsurpassed, complete enlightenment, will never depart from the perfection of meditative concentration. “

source: སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས་ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཤིག་མངོན་པར་སྤྲུལ་ཏེ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་ན། རབ་འབྱོར་འདི་ལ་ཇི་སྙམ་དུ་སེམས།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people and then establish them in the perfection of meditative concentration, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would establish any beings in the perfection of meditative concentration?” “

source: སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་དེས། སེམས་ཅན་གང་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་པ་ཡོད་དམ།
en: No, Blessed Lord!”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། སེམས་ཅན་ཐམས་ཅད་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་པ་མེད་དོ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish all beings in the perfection of meditative concentration, but they do not actually establish any beings at all in the perfection of meditative concentration.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཤིང་གཞོག་གོ །འགོད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Moreover, Subhūti, when bodhisattva great beings dwell in the perfection of wisdom, they will encourage, secure, and establish all beings in the perfection of wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་བ་དང་། གཞོག་ཅིང་འགོད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། ཚུ་རོལ་ཏམ། ཕ་རོལ་མི་དམིགས་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་ཏེ། དེ་དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོའམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ།
en: Subhūti, if one were to ask in what way bodhisattva great beings, abiding in the perfection of wisdom, encourage, secure, and establish all beings in the perfection of wisdom, Subhūti, it is by those bodhisattva great beings practicing the perfection of wisdom, {Dt.190} and not apprehending anything that may be arising, ceasing, afflicted, purified, imminent, or transcendent, for that, Subhūti, is how bodhisattva great beings dwell in the perfection of wisdom: that is how they encourage, secure, and establish all beings, too, in the perfection of wisdom. “

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ཏེ། བཞག་ཅིང་བཀོད་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོའམ།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people and then encourage, secure, and establish them in the perfection of wisdom, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would establish any beings in the perfection of wisdom?” “

source: སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས། སེམས་ཅན་
en: No, Blessed Lord!”

source: གང་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་པ་ཡོད་དམ། གསོལ་པ།
en: he responded.

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བཀོད་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish all beings in the perfection of wisdom, but they have not actually established any beings at all in the perfection of wisdom.

source: རབ་འབྱོར་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་ཤིང་།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor. “

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་དུ་སོང་ཞིང་། ཇི་ལྟར་བདག་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེ་བཞིན་དུ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ། །ཇི་ལྟར་བདག་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings have donned the great armor, they proceed to the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and, just as they themselves dwell in the perfection of generosity, they similarly encourage, secure, and establish all beings, as many as there are in those world systems, in the perfection of generosity.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེ་བཞིན་དུ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །
en: Just as they themselves dwell in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, they similarly encourage, secure, and establish all beings, as many as there are in those world systems, in [those perfections, up to and including] the perfection of wisdom.

source: འགོད་དོ། །འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ཀྱིས་ཆོས་ཀྱང་སྟོན་ཏེ།
en: That is to say, they teach the Dharma connected with these six perfections.

source: སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་དེ་ཐོས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་།
en: beings, too, on hearing this Dharma, will never be separated from the six perfections until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སོང་ཞིང་། ཇི་ལྟར་བདག་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བར་ལ་གནས་པ་དེ་བཞིན་དུ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འགོད་དོ།
en: They proceed to the world systems of the each of the [other] directions—south, west, north, northeast, southeast, southwest, northwest, nadir, and zenith—numerous as the grains of sand of the river Gaṅgā, and, just as they themselves dwell in the perfection of generosity, and in [the other perfections], up to and including the perfection of wisdom, they similarly encourage, secure, and establish all beings, as many as there are in those world systems, in the perfection of generosity.

source: །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །
en: Similarly, they encourage, secure, and establish them in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: འགོད་དོ། །འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ཀྱི་ཆོས་ཀྱང་སྟོན་ཏོ།
en: That is to say, they teach the Dharma connected with these six perfections.

source: །སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་དེ་ཐོས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ།
en: beings, too, on hearing this Dharma, will never be separated from the six perfections until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་ཡང་དག་པར་བསྐུལ་ཞིང་བཞག་སྟེ། བཀོད་པར་གྱུར་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས། སེམས་ཅན་གང་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་ཡང་དག་པར་བསྐུལ་ཞིང་བཞག་སྟེ།
en: Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people and then encourage, secure, and establish them in the six perfections, do you think, Subhūti, that this illusionist or the apprentice of an illusionist would actually encourage, secure, and establish any beings in the six perfections?” “

source: བཀོད་པ་ཡོད་དམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་།
en: No, Blessed Lord!”

source: ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་།
en: he responded.

source: ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་བཀོད་ཀྱང་། སེམས་ཅན་གང་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་བཀོད་པ་མེད་དོ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings establish all beings, as many as there are in the world systems in each of the directions—east, south, west, north, northeast, southeast, southwest, northwest, nadir, and zenith—numerous as the grains of sand of the river Gaṅgā, in the six perfections, but they do not actually establish any beings at all in the six perfections.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because, commencing with the reality of illusion, this is in fact the reality of all phenomena.

source: རབ་འབྱོར་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་རྣམ་པར་སྤྱོད་ཅིང་། སེམས་བསྐྱེད་པ་གཞན་གྱི་གོ་མི་འབྱེད་དེ། བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དགོད་པར་བྱའོ། །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings have donned the great armor, and engage with a mind set on all-aspect omniscience, they do not allow any opportunity for any other mindsets to develop, such as thinking, ‘I must establish this many beings in the perfection of generosity, but I must not establish that many beings in it.

source: །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ད་གོད་པར་བྱའོ།
en: I must establish this many beings in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, but I must not establish that many beings in them.

source: །འདི་སྙེད་ཅིག་ནི་ད་གོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in the thirty-seven factors conducive to enlightenment, but I must not establish that many in them.

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, but I must not establish that many in them.

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in the fruit of entering the stream to nirvāṇa, but I must not establish that many in it.

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in the fruit of being destined for only one more rebirth, in the fruit of no longer being subject to rebirth, and in arhatship, but I must not establish that many in them.

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་རང་བྱང་ཆུབ་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in individual enlightenment, but I must not establish that many in it.

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །བདག་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: I must establish this many beings in all-aspect omniscience, but I must not establish that many [in it].’

source: །འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ་ཞེས་བྱ་བར་སེམས་བསྐྱེད་པའི་གོ་མི་འབྱེད་ཀྱི་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: There is no opportunity for such thoughts to arise.

source: བདག་གིས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དགོད་པར་བྱའོ།
en: Rather, they should think, ‘I shall establish immeasurable and countless beings in the perfection of generosity.

source: །བདག་གིས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དགོད་པར་བྱའོ།
en: I shall establish immeasurable and countless beings in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in the emptiness of internal phenomena.

source: །ཕྱི་སྟོང་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in the emptiness of external phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་དགོད་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་།
en: I shall establish them in the thirty-seven factors conducive to enlightenment.

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in the four truths of the noble ones, the four meditative concentrations, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness that are the gateways to liberation, the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་དགོད་པར་བྱའོ།
en: I shall them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and in arhatship.

source: །རང་བྱང་ཆུབ་ལ་དགོད་པར་བྱའོ།
en: I shall establish them in individual enlightenment.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པར་བྱའོ་ཞེས་བྱ་བར་སེམས་བསྐྱེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ།
en: I shall establish them in all-aspect omniscience.’ {

source: སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ་ཞིག་གིས། ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་མདུན་དུ། སྐྱེ་བོ་མང་པོའི་ཚོགས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་འདི་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་དགོད་པར་བྱའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དགོད་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་གྱུར་ན།
en: Dt.191} “Subhūti, if, as an analogy, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to emanate a large gathering of people, thinking, ‘I shall establish immeasurable and countless beings in the six perfections.

source: རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས། སེམས་ཅན་གང་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་དགོད་པར་བྱས་པ་ཡོད་དམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དགོད་པར་བྱས་པ་ཡོད་དམ།
en: I shall establish them [in the causal and fruitional attributes and goals], up to and including all-aspect omniscience,’ do you think, Subhūti, that this illusionist or the apprentice of an illusionist would actually establish any beings in the six perfections, or would he establish anyone in [the causal and fruitional attributes and goals], up to and including all-aspect omniscience?” “

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དགོད་པར་སེམས་བསྐྱེད་ཀྱང་། སེམས་ཅན་གང་གི་དོན་དུ་ཡང་སེམས་བསྐྱེད་པ་མེད་དེ།
en: The Blessed One then said, “Subhūti, in the same manner, bodhisattva great beings think they will establish immeasurable and countless beings in the six perfections and in [the causal and fruitional attributes and goals], up to and including all-aspect omniscience, but they do not actually cultivate such thoughts for the sake of any beings.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་དེ་བཞིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because, commencing with the reality of illusion, this is in fact the reality of all phenomena.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Subhūti, it is in this way that bodhisattva great beings are said to don the great armor.”

source: བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ། གོ་ཆ་མ་མཆིས་པའི་གོ་ཆ་བགོས་པར་རིག་པར་བགྱིའོ།
en: Then the venerable Subhūti said, “As I understand the teachings given by the Blessed Lord, on account of the emptiness of intrinsic defining characteristics, bodhisattva great beings should know that they are donning armor that is a nonexistent armor.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གཟུགས་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: If one were to ask why, Blessed Lord, it is because physical forms are empty of physical forms.
